<?php

namespace Database\Seeders;
use App\Models\Author;
use App\Models\Book;
use App\Models\Category;
use App\Models\Publisher;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $book1 = Book::create([
            'category_id' => Category::where('name', 'اللغة العربية')->first()->id,
            'publisher_id' => Publisher::where('name', 'الناشرون')->first()->id,
            'title' => 'الحيوان',
            'description' => 'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '544',
            'price' => '17',
            'isbn'=>'100000000000',
            'cover_image' => 'images/covers/1.jpg',
        ]);
        $book1->authors()->attach(Author::where('name', 'الجاحظ')->first());

        $book2 = Book::create([
            'category_id' => Category::where('name', 'التاريخ')->first()->id,
            'publisher_id' => Publisher::where('name', 'دار النشر')->first()->id,
            'title' => 'مذكرات علي الطنطاوي',
            'description' => 'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '452',
            'price' => '22',
            'isbn'=>'100000000001',
            'cover_image' => 'images/covers/2.jpg',
        ]);
        $book2->authors()->attach(Author::where('name', 'علي الطنطاوي')->first());
        
        $book3 = Book::create([
            'category_id' => Category::where('name', 'الرواية')->first()->id,
            'publisher_id' => Publisher::where('name', 'دار الفكر')->first()->id,
            'title' => 'المجرم',
            'description' => 'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '18',
            'isbn'=>'100000000002',
            'cover_image' => 'images/covers/3.jpg',
        ]);
        $book3->authors()->attach(Author::where('name', 'أغاثا كريستي')->first());
        
        $book4 = Book::create([
            'category_id' => Category::where('name', 'تطوير الذات')->first()->id,
            'publisher_id' => Publisher::where('name', 'الناشرون')->first()->id,
            'title' => 'العمل العميق',
            'description' => 'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '24',
            'isbn'=>'100000000004',
            'cover_image' => 'images/covers/5.jpg',
        ]);
        $book4->authors()->attach(Author::where('name', 'كارل نيو بورت')->first());
        
        $book5 = Book::create([
            'category_id' => Category::where('name', 'التاريخ')->first()->id,
            'publisher_id' => Publisher::where('name', 'دار الفكر')->first()->id,
            'title' => 'المقدمة',
            'description' =>  'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '20',
            'isbn'=>'100000000005',
            'cover_image' => 'images/covers/6.jpg',
        ]);
        $book5->authors()->attach(Author::where('name', 'ابن خلدون')->first());

        $book6 = Book::create([
            'category_id' => Category::where('name', 'اللغة العربية')->first()->id,
            'publisher_id' => Publisher::where('name', 'الناشرون')->first()->id,
            'title' => 'الكتاب',
            'description' =>  'هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '20',
            'isbn'=>'100000000005',
            'cover_image' => 'images/covers/4.jpg',
        ]);
        $book6->authors()->attach(Author::where('name', 'سيبويه')->first());
    }
}
